---
kind: method
id: M:Autodesk.Revit.DB.ElementLogicalFilter.GetFilters
source: html/e7369155-14ee-f702-132f-b19c3a300c80.htm
---
# Autodesk.Revit.DB.ElementLogicalFilter.GetFilters Method

Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.

## Syntax (C#)
```csharp
public IList<ElementFilter> GetFilters()
```

## Returns
Copies of the filters that are logically combined by this ElementLogicalFilter.